AUTO_config_TK_pesok/src/DataProcessors/ТК_ЗагрузкаПриходовТедис/ТК_ЗагрузкаПриходовТедис.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ТК_ЗагрузкаПриходовТедис</name>
</mdclass:DataProcessor>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_УчетХарактеристикНаСкладах/ТК_УчетХарактеристикНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_УчетХарактеристикНаСкладах</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>НеВестиУчетПоХарактеристикам</name>
    <comment>Не вести учет по характеристикам на данном складе</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>СкладКомпании</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_УчетнаяПолитикаТорговыхПлощадок/ТК_УчетнаяПолитикаТорговыхПлощадок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_УчетнаяПолитикаТорговыхПлощадок</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <dimensions>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатуры</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <comment>Заказ покупателя</comment>
  <basedOn>Document.ПоступлениеТоваров</basedOn>
  <registerRecords>AccumulationRegister.ОбработкаЗаказовПоставщику</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПокупателей</registerRecords>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Юридическое лицо, от которого выписан документ</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Поставщик/комитент от которого мы получили товар</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорВзаиморасчетов</name>
    <comment>Договор по которому ведутся взаиморасчеты с контрагентом</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДокумента</name>
    <comment>Курс валюты документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>Сумма документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладКомпании</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставки</name>
    <comment>Срок отгрузки товаров по заказу контрагенту</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегламентированныйУчет</name>
    <comment>Флаг отражения документа в регламентированном учете</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаДоставки</name>
    <comment>Адрес доставки для использования в печатных формах (оставлен для совместимости)</comment>
    <type>
      <types>CatalogRef.ТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксироватьЦены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПробивкаБезОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>GuidСистемыСоздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйКомментарий</name>
    <comment>Произвольный дополнительный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортативноеУстройствоВвода</name>
    <type>
      <types>CatalogRef.ПортативныеУстройстваВвода</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоРедактирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДДокументаОтгрузки</name>
    <comment>ID документа отгрузки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакОсновногоЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадкаПолучатель</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ, на основании которого введен данный</comment>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ПоступлениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <comment>Сотрудник, заключивший сделку с контрагентом</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РезервироватьВОсновныхЕдиницах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>Таблица товаров и услуг</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура (товар, услуга и т.п.)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>Единица измерения номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>Характеристика/серия номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество единиц измерения номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБазовое</name>
      <comment>Количество номенклатуры в базовых единицах (коэффициент=1)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Цена номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезНалогов</name>
      <comment>Цена без налогов</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>Сумма всегда без скидки. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВсего</name>
      <comment>Итоговая сумма по строке документа со всеми налогами</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>Ставка НДС по номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>Сумма НДС по номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНалогов</name>
      <comment>Сумма всегда без скидки. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <comment>Процент скидки на продаваемый товар</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <comment>Сумма скидки по строке документа</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределениеЗаказовПоставщиков</name>
    <attributes>
      <name>ЗаказПоставщику</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Catalogs/ТипыЦен/ТипыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыЦен</name>
  <comment>Типы цен</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НормативнаяЦена</name>
      <description>Нормативная цена</description>
    </items>
    <items>
      <name>ОсновнойТипЦенЗакупки</name>
      <description>Основной тип цен закупки</description>
    </items>
    <items>
      <name>ОсновнойТипЦенПродажи</name>
      <description>Основной тип цен продажи</description>
    </items>
  </predefined>
  <attributes>
    <name>БазовыйТипЦен</name>
    <comment>Тип цен, от которого рассчитываются цены данного типа, если не выбран, то цены задаются вручную</comment>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаЦены</name>
    <comment>Валюта цены (для цен не в валюте учета товара)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <comment>Вид оплаты</comment>
    <type>
      <types>EnumRef.ВидыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенЗакупки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенЗаБлок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВестиУчетПоХарактеристикам</name>
    <comment>Не вести учет по характеристикам</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <comment>Истина - цена включает НДС, ложь - цена НДС не включает</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОкругления</name>
    <type>
      <types>EnumRef.ВариантыОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>Точность</name>
    <comment>Количество значащих знаков цены после запятой</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоРасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетСогласования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/DataProcessors/ТК_ЗагрузкаПриходовТедис/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ПрограммныйИнтерфейс
	
	Функция ЗагрузитьФайлы(Знач ПараметрыЗагрузки) Экспорт 
		
		Результат = Новый Структура;
		КешЗагружаемыхДанных = Новый Структура;
		
		ДатаЗагрузки 	 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗагрузки, "ДатаЗагрузки", ТекущаяДата());
		ДеревоДокументов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗагрузки, "ДеревоДокументов", Новый ДеревоЗначений);
		СоздатьМРЦ		 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗагрузки, "СоздатьМРЦ", Ложь);
		
		ТаблицаНовыхМРЦ = Новый ТаблицаЗначений;
		ТаблицаНовыхМРЦ.Колонки.Добавить("ТипЦен", Новый ОписаниеТипов("СправочникСсылка.ТипыЦен"));
		ТаблицаНовыхМРЦ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаНовыхМРЦ.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ТаблицаНовыхМРЦ.Колонки.Добавить("Цена", ОбщегоНазначения.ОписаниеТипаЧисло(15,6));
		
		КешЗагружаемыхДанных.Вставить("ТаблицаНовыхМРЦ", ТаблицаНовыхМРЦ);	
		КешЗагружаемыхДанных.Вставить("СоздатьМРЦ", СоздатьМРЦ);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Владелец КАК Номенклатура,
		|	ХарактеристикиНоменклатуры.ЗначениеМРЦ КАК МРЦ,
		|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
		|	ЛОЖЬ КАК НоваяХарактеристика
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	НЕ ХарактеристикиНоменклатуры.ПометкаУдаления";
		
		ТаблицаХарактеристик = Запрос.Выполнить().Выгрузить();
		ТаблицаХарактеристик.Индексы.Добавить("Номенклатура, МРЦ");
		КешЗагружаемыхДанных.Вставить("КешХарактеристика", ТаблицаХарактеристик);
		
		
		МассивФайлов = ПроверитьНаличиеФайлов(ДатаЗагрузки);
		Если МассивФайлов = Неопределено 
			ИЛИ МассивФайлов.Количество() = 0 Тогда 
			
			Возврат Результат;
		КонецЕсли;	
		
		Ит = 0;
		Для Каждого ТекФайл Из МассивФайлов Цикл 
			Ит = Ит + 1;
			
			Попытка
				ДеревоЗначений = ИзXMLВДерево(ТекФайл.ПолноеИмя);
			Исключение
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
				Продолжить;
			КонецПопытки;
			СтруктураДокумента = ПолучитьСтруктуруДокумента(ДеревоЗначений);
			
			Если НЕ СтруктураДокументаВерна(СтруктураДокумента, ТекФайл) Тогда
				Продолжить;
			КонецЕсли;
			СтруктураДокумента.Вставить("ИмяФайла",ТекФайл.Имя);
			
			ЗаполнитьДеревоДокументов(СтруктураДокумента, ДеревоДокументов, КешЗагружаемыхДанных);
		КонецЦикла;	
		
		ТаблицаНовыхМРЦ = КешЗагружаемыхДанных.ТаблицаНовыхМРЦ;
		
		Если ТаблицаНовыхМРЦ.Количество() > 0 Тогда
			СформироватьПереоценкиНовыхМРЦ(ТаблицаНовыхМРЦ);	
		КонецЕсли;
		
		Результат.Вставить("ДеревоДокументов", ДеревоДокументов);
		
		Возврат Результат;
		
	КонецФункции
	
	Функция СформироватьДокументы(Знач ДеревоДокументов, Знач ДопПараметры) Экспорт 
		
		УстановитьПривилегированныйРежим(Истина);
		
		//СкладКомпании = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопПараметры, "СкладКомпании", ПредопределенноеЗначение("Справочник.СкладыКомпании.ПустаяСсылка"));
		КонтрагентПоставщик = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопПараметры, "КонтрагентПоставщик", ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));
		ДоговорПоставщик = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопПараметры, "ДоговорПоставщик", ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка"));
		Организация = ДоговорПоставщик.Организация;
		
		Автор = Пользователи.ТекущийПользователь();
		ВалютаДокумента = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета(ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка"));
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СкладыКомпании.Ссылка КАК СкладКомпании,
		|	СкладыКомпании.Подразделение КАК Подразделение,
		|	СкладыКомпании.ТипЦенСебестоимости КАК ТипЦен,
		|	ЕСТЬNULL(ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
		|	СкладыКомпании.ТорговаяПлощадка КАК ТорговаяПлощадка,
		|	ЕСТЬNULL(ТК_УчетХарактеристикНаСкладахСрезПоследних.НеВестиУчетПоХарактеристикам, ЛОЖЬ) КАК НеВестиУчетПоХарактеристикам
		|ИЗ
		|	РегистрСведений.ТК_УчетХарактеристикНаСкладах.СрезПоследних КАК ТК_УчетХарактеристикНаСкладахСрезПоследних,
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних(, ТорговаяПлощадка = ВЫРАЗИТЬ(&Ссылка КАК Справочник.СкладыКомпании).ТорговаяПлощадка) КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних
		|		ПО СкладыКомпании.ТорговаяПлощадка = ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.ТорговаяПлощадка
		|ГДЕ
		|	СкладыКомпании.Ссылка = &Ссылка";
		
		Результат = Новый Структура;
		
		Ит = 0;
		Для Каждого СтрокаДереваДокумент Из ДеревоДокументов.Строки Цикл 
			Ит = Ит + 1;
			
			Если СтрокаДереваДокумент.Выбор = Ложь Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаДереваДокумент.СкладКомпании.Подразделение <> ДоговорПоставщик.Подразделение Тогда
				ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Подразделение склада %1 не соответствует подразделению договора. Пропускаем...'; uk = 'Підрозділ %1 складу %1 не відповідає підрозділу договору. Пропускаємо...'"),
				СтрокаДереваДокумент.СкладКомпании));					
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДереваДокумент.ДокументЗагрузки) Тогда
				ДокументПоставкиОбъект = СтрокаДереваДокумент.ДокументЗагрузки.ПолучитьОбъект();
				ДокументПоставкиОбъект.Товары.Очистить();			
			Иначе
				ДокументПоставкиОбъект = Документы.ПоступлениеТоваров.СоздатьДокумент();
			КонецЕсли;
			
			СкладКомпании = СтрокаДереваДокумент.СкладКомпании;
			Если Не ЗначениеЗаполнено(СкладКомпании) Тогда 
				ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В строке файла ""%1"" не заполнен Склад. Документ не загружен.'; uk = 'У рядку файлу ""%1"" не заповнений Склад. Документ не завантажений'"),
				СтрокаДереваДокумент.ИмяФайла));
				Продолжить;
			КонецЕсли;
			
			Запрос.УстановитьПараметр("Ссылка", СкладКомпании);
			РеквизитыСклада = Новый Структура("Подразделение, ТипЦен, Организация, ТорговаяПлощадка, НеВестиУчетПоХарактеристикам",
			ПредопределенноеЗначение("Справочник.ПодразделенияКомпании.ПустаяСсылка"),
			ПредопределенноеЗначение("Справочник.ТипыЦен.ПустаяСсылка"),
			ПредопределенноеЗначение("Справочник.ТорговыеПлощадки.ПустаяСсылка"),
			Ложь);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда 
				ЗаполнитьЗначенияСвойств(РеквизитыСклада, Выборка);		
			КонецЕсли;
			
			
			ДокументПоставкиОбъект.РегламентированныйУчет = Истина;
			
			ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
			Аттика = "000000002";
			Если Не ТекПользователь.Подразделение.Код = Аттика  Тогда
				ДокументПоставкиОбъект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПоступлениеТоваров");
				ДокументПоставкиОбъект.Организация = Организация;
			Иначе
				ДокументПоставкиОбъект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПоступлениеТоваровТранзиты");
				ДокументПоставкиОбъект.Организация = Справочники.ТорговыеПлощадки.ОрганизацияТорговойПлощадки(РеквизитыСклада.ТорговаяПлощадка, ТекущаяДата());
			КонецЕсли;
			ДокументПоставкиОбъект.Автор = Автор;
			ДокументПоставкиОбъект.ПодразделениеКомпании = РеквизитыСклада.Подразделение;		
			ДокументПоставкиОбъект.ТорговаяПлощадка = РеквизитыСклада.ТорговаяПлощадка;
			ДокументПоставкиОбъект.СкладКомпании = СкладКомпании;
			ДокументПоставкиОбъект.ТипЦен = РеквизитыСклада.ТипЦен;
			ДокументПоставкиОбъект.ВалютаДокумента = ВалютаДокумента;
			ДокументПоставкиОбъект.КурсДокумента = 1;
			
			ДокументПоставкиОбъект.Дата = ТекущаяДата();
			ДокументПоставкиОбъект.УстановитьНовыйНомер();
			
			ДокументПоставкиОбъект.Контрагент = КонтрагентПоставщик;
			ДокументПоставкиОбъект.ДоговорВзаиморасчетов = ДоговорПоставщик;
			
			
			ДокументПоставкиОбъект.ВхДокДата = СтрокаДереваДокумент.ДатаДокумента;
			ДокументПоставкиОбъект.ВхДокНомер = СтрокаДереваДокумент.НомерДокумента;
			
			////Задача № 20518
			////СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
			
			
			Для Каждого СтрокаТовары Из СтрокаДереваДокумент.Строки Цикл 
				НоваяСтрокаТовары = ДокументПоставкиОбъект.Товары.Добавить();
				
				НоваяСтрокаТовары.Номенклатура = СтрокаТовары.ДокументНоменклатура;			
				НоваяСтрокаТовары.ХарактеристикаНоменклатуры =  СтрокаТовары.ХарактеристикаНоменклатуры;
				НоваяСтрокаТовары.Количество =   СтрокаТовары.Количество;
				НоваяСтрокаТовары.КоличествоБазовое =   СтрокаТовары.Количество;
				НоваяСтрокаТовары.КоличествоПоставщика =   СтрокаТовары.Количество;
				//НоваяСтрокаТовары.СтавкаНДС = СтавкаНДС;
				НоваяСтрокаТовары.ЦенаБезНалогов =   СтрокаТовары.Цена;
			КонецЦикла;
			
			тзТоварыДокумента = ДокументПоставкиОбъект.Товары.Выгрузить();
			тзТоварыДокумента.Колонки.Добавить("ХарактеристикиИспользуются");
			
			Кэш = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
			
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
			СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре",Новый Структура("Контрагент,Организация,ТорговаяПлощадка,ТипСтавкиНДС",ДокументПоставкиОбъект.Контрагент,ДокументПоставкиОбъект.Организация,ДокументПоставкиОбъект.ТорговаяПлощадка,"Закупка"));
			СтруктураДействий.Вставить("ПересчитатьЦенуСНДС");
			СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");
			СтруктураДействий.Вставить("ПересчитатьСумму");
			СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");
			СтруктураДействий.Вставить("ПересчитатьСуммуВсего");
			СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));	
			
			Для Каждого ТекущаяСтрока Из тзТоварыДокумента Цикл
				Если НЕ ТекущаяСтрока.Номенклатура.ИспользованиеХарактеристик И ЗначениеЗаполнено(ТекущаяСтрока.ХарактеристикаНоменклатуры) Тогда	// костыль Задача № 20634
					ТекущаяСтрока.ХарактеристикаНоменклатуры = Ложь;
					ТекущаяСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
					СтруктураДействий.Удалить("ЗаполнитьСтавкуНДСПоНоменклатуре");
				Иначе
					СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре",Новый Структура("Контрагент,Организация,ТорговаяПлощадка,ТипСтавкиНДС",ДокументПоставкиОбъект.Контрагент,ДокументПоставкиОбъект.Организация,ДокументПоставкиОбъект.ТорговаяПлощадка,"Закупка"));
				КонецЕсли;
				
				СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу", ТекущаяСтрока.ЕдиницаИзмерения);
				ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Кэш);					
			КонецЦикла;			
			
			ДокументПоставкиОбъект.Товары.Загрузить(тзТоварыДокумента);
			
			Попытка
				Если ДокументПоставкиОбъект.ПроверитьЗаполнение() Тогда 
					
					ДокументПоставкиОбъект.Записать();
					
					//ДокументПоставкиОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
				Иначе
					ДокументПоставкиОбъект.Записать();
					
					ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Документ %1 не проведен'; uk = 'Документ %1 не проведений'"),
					ДокументПоставкиОбъект.Ссылка),
					ДокументПоставкиОбъект.Ссылка);
				КонецЕсли;
			Исключение                                                                  
				ДокументПоставкиОбъект.Записать();
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
			
			СтрокаДереваДокумент.ДокументЗагрузки = ДокументПоставкиОбъект.Ссылка;	
			
			СтрокаДереваДокумент.Выбор = Ложь	
			
		КонецЦикла;	
		
		Результат.Вставить("ДеревоДокументов", ДеревоДокументов);
		
		Возврат Результат;
	КонецФункции
	
	
	#КонецОбласти
	
	
	#Область СлужебныеПроцедурыИФункции
	
	Функция ПроверитьНаличиеФайлов(ДатаЗагрузки)
		
		ПараметрыПодключения = ПолучитьПараметрыПодключения(ДатаЗагрузки);
		
		Сервер = ПолучитьFTPСоединение(ПараметрыПодключения);
		
		Если Сервер = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Попытка Сервер.УстановитьТекущийКаталог(ПараметрыПодключения.ТекущийКаталогFTP);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Нет данных за выбранную дату %1
			|1.Проверьте выбор даты.
			|2.Уточните у поставщика за выгрузку в этом числе!'; uk = 'Немає даних за обрану дату %1
			|1. Перевірте вибір дати.
			|2. Уточніть у постачальника за вивантаження за вказану дату!'"),
			Формат(ДатаЗагрузки, "ДФ=yyyy-MM-dd")));					
			Возврат Неопределено;
		КонецПопытки;
		
		МассивФайлов = Сервер.НайтиФайлы(ПараметрыПодключения.ТекущийКаталогFTP,"*.xml");
		КолвоФайлов =  МассивФайлов.Количество();
		
		ОбщегоНазначения.СообщитьПользователю(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Найдено %1 файлов на FTP...'; uk = 'Знайдено %1 файлів на FTP...'"),
		КолвоФайлов));					
		
		
		Если КолвоФайлов =  0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ОдинПроцент = КолвоФайлов/100;
		НомЭлемента = 0;
		
		Для Каждого Файл Из МассивФайлов Цикл			
			НомЭлемента = НомЭлемента + 1;
			
			//Каталоги пропускаем
			Если НЕ Файл.Этофайл() Тогда
				Продолжить;
			КонецЕсли;
			
			////Проверим файл в каталоге
			//Если ТипЗагрузки = 1 Тогда
			//	зФайлы = НайтиФайлы(ПараметрыПодключения.КаталогВременныхФайлов + "/" + Файл.Имя);
			//	Если зФайлы.Количество() >0 Тогда
			//		Продолжить;
			//	КонецЕсли;
			//КонецЕсли;
			
			Сервер.Получить(Файл.ПолноеИмя, ПараметрыПодключения.КаталогВременныхФайлов + "/" + Файл.Имя);
		КонецЦикла;
		
		Файлы = НайтиФайлы(ПараметрыПодключения.КаталогВременныхФайлов, "*.xml");
		
		
		Возврат Файлы;
		
	КонецФункции
	
	Функция ПолучитьПараметрыПодключения(ДатаЗагрузки)
		//ИмяБазы = НРег(НСтр(СтрокаСоединенияИнформационнойБазы(), "Ref"));
		//Если ИмяБазы = "work_attika_kiev" Тогда
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		Аттика = "000000002";
		Если ТекПользователь.Подразделение.Код <> Аттика  Тогда
			
			ПараметрыПодключения = Новый Структура("ИмяСервераFTP,ПортFTP,ИмяПользователяНаСервере,ПарольПользователяНаСервере,ПассивныйРежим,ИспользуетсяПрокси");
			//ПараметрыПодключения.ИмяСервераFTP = "185.41.248.90";//"85.223.213.93";
			ПараметрыПодключения.ИмяСервераFTP = "ftprepexch.tedis.ua";
			ПараметрыПодключения.ПортFTP = 21;
			ПараметрыПодключения.ИмяПользователяНаСервере = "osnovainfo";
			ПараметрыПодключения.ПарольПользователяНаСервере = "5AmF9c24*4_1#@4";
			ПараметрыПодключения.ПассивныйРежим = Истина;
			ПараметрыПодключения.ИспользуетсяПрокси = Ложь;
			Префикс = "Б_";
		Иначе
			
			ПараметрыПодключения = Новый Структура("ИмяСервераFTP,ПортFTP,ИмяПользователяНаСервере,ПарольПользователяНаСервере,ПассивныйРежим,ИспользуетсяПрокси");
			//ПараметрыПодключения.ИмяСервераFTP = "185.41.248.90";//"85.223.213.93";
			ПараметрыПодключения.ИмяСервераFTP = "ftprepexch.tedis.ua";
			ПараметрыПодключения.ПортFTP = 21;
			ПараметрыПодключения.ИмяПользователяНаСервере = "mbs";
			ПараметрыПодключения.ПарольПользователяНаСервере = "vdJ4Xuq^Mkq";
			ПараметрыПодключения.ПассивныйРежим = Истина;
			ПараметрыПодключения.ИспользуетсяПрокси = Ложь;
			Префикс = "А_";
		КонецЕсли;
		//Иначе
		//	ПараметрыПодключения = Новый Структура("ИмяСервераFTP,ПортFTP,ИмяПользователяНаСервере,ПарольПользователяНаСервере,ПассивныйРежим,ИспользуетсяПрокси");
		//	ПараметрыПодключения.ИмяСервераFTP = "ckr.tedis-ukraine.com.ua";//"85.223.213.93";
		//	ПараметрыПодключения.ПортFTP = 21;
		//	ПараметрыПодключения.ИмяПользователяНаСервере = "shidna_tk";
		//	ПараметрыПодключения.ПарольПользователяНаСервере = "C{|Ylo%";
		//	ПараметрыПодключения.ПассивныйРежим = Истина;
		//	ПараметрыПодключения.ИспользуетсяПрокси = Ложь;
		//КонецЕсли; 
		
		//2018_03_22
		КаталогФТП = Формат(ДатаЗагрузки, "ДФ=yyyy_MM_dd");
		
		ПараметрыПодключения.Вставить("ТекущийКаталогFTP","/"+КаталогФТП+"/");
		КаталогВременныхФайлов = КаталогВременныхФайлов()+Префикс + КаталогФТП+"\"; //ПутьЗагрузкиФайлов+"\"+КаталогФТП+"\"; 
		
		СоздатьКаталог(КаталогВременныхФайлов);
		ПараметрыПодключения.Вставить("КаталогВременныхФайлов",КаталогВременныхФайлов);
		
		Возврат  ПараметрыПодключения;
		
	КонецФункции
	
	Функция ПолучитьFTPСоединение(ПараметрыПодключения)
		
		
		Попытка
			Сервер = Новый FTPСоединение(ПараметрыПодключения.ИмяСервераFTP,, ПараметрыПодключения.ИмяПользователяНаСервере,  ПараметрыПодключения.ПарольПользователяНаСервере, , Ложь,,,УровеньИспользованияЗащищенногоСоединенияFTP.НеИспользовать);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			Возврат Неопределено;
		КонецПопытки;
		
		Возврат Сервер;
		
	КонецФункции
	
	Функция	ИзXMLВДерево(ИмяФайла, Дерево = Неопределено, ЧтениеXML = Неопределено, СтрокиДерева = Неопределено)
		
		Если ЧтениеXML = Неопределено Тогда
			
			ЧтениеXML	= Новый ЧтениеXML;
			Дерево		= Новый ДеревоЗначений;
			Дерево.Колонки.Добавить("Имя");
			Дерево.Колонки.Добавить("Значение");
			Дерево.Колонки.Добавить("Атрибуты");
			ЧтениеXML.ОткрытьФайл(ИмяФайла);
			ИзXMLВДерево(ИмяФайла, Дерево, ЧтениеXML, Дерево.Строки);
			
		Иначе
			
			Пока ЧтениеXML.Прочитать() Цикл 
				
				Если		ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
					НоваяСтрока = СтрокиДерева.Добавить();
					НоваяСтрока.Имя = ЧтениеXML.Имя;
					ИзXMLВДерево(ИмяФайла, Дерево, ЧтениеXML, НоваяСтрока.Строки);
					Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
						НоваяСтрокаАтрибут = НоваяСтрока.Строки.Добавить();
						НоваяСтрокаАтрибут.Имя = ЧтениеXML.Имя;
						НоваяСтрокаАтрибут.Значение = ЧтениеXML.Значение;
						НоваяСтрокаАтрибут.Атрибуты = Истина;
					КонецЦикла;
				ИначеЕсли	ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда 
					СтрокиДерева.Родитель.Значение = ЧтениеXML.Значение;
				ИначеЕсли	ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда 	
					Прервать;
				КонецЕсли;	
				
			КонецЦикла;	
			
		КонецЕсли;
		
		Возврат Дерево;
		
	КонецФункции	
	
	Функция  ПолучитьСтруктуруДокумента(Дерево)
		СтруктураДокумента = Новый Структура;
		СтруктураДокумента.Вставить("ДокументКорректен",1);
		
		Попытка
			Поставщик        = НайтиСтрокиВДереве("DATA/Stock/DistName", Дерево)[0].Значение;
			СтруктураДокумента.Вставить("СтрокаПоставщик",Поставщик);
			
			НомерДокумента	 = НайтиСтрокиВДереве("DATA/Stock/StockCode", Дерево)[0].Значение;
			ТочкаДоставки	 = НайтиСтрокиВДереве("DATA/Stock/StockName", Дерево)[0].Значение;
			Если Найти(НомерДокумента,":")> 0 Тогда
				МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(НомерДокумента, ":");
				СтруктураДокумента.Вставить("НомерЗаказа",СокрЛП(МассивСтрок.Получить(0)));
				СтруктураДокумента.Вставить("ДатаЗаказа", Дата(МассивСтрок.Получить(1)));
				СтруктураДокумента.Вставить("ДокументАгента", 1);
			ИначеЕсли Найти(НомерДокумента,"-")> 0 Тогда
				МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(НомерДокумента,"-");			
				СтруктураДокумента.Вставить("ОКПО_Покупатель", МассивСтрок.Получить(0));
				СтруктураДокумента.Вставить("КодТочкиДоставкиПокупатель", МассивСтрок.Получить(1));
				СтруктураДокумента.Вставить("ДокументАгента", 0);	
			Иначе
				тзСкладов = ПолучитьОбъектДоставки(НомерДокумента);
				Если тзСкладов.Количество() = 0 Тогда
					ДобавитьОшибкуВСтруктуруДокумента("В файле не указан номер точки доставки",СтруктураДокумента);
				Иначе
					стрСклада = тзСкладов[0];
					СтруктураДокумента.Вставить("ДокументАгента", 2); //Автозаказ тедис на наши объекты
					СтруктураДокумента.Вставить("ТочкаДоставкиПокупатель",стрСклада.ТочкаДоставкиПокупатель);
					СтруктураДокумента.Вставить("КонтрагентПокупатель",стрСклада.КонтрагентПокупатель);
					СтруктураДокумента.Вставить("СкладКомпании",стрСклада.СкладКомпании);
					СтруктураДокумента.Вставить("ТорговаяПлощадка",стрСклада.ТорговаяПлощадка);
					
				КонецЕсли;
				
			КонецЕсли;
		Исключение
			ДобавитьОшибкуВСтруктуруДокумента("Ошибка разбора структуры документа" + ОписаниеОшибки(),СтруктураДокумента);
		КонецПопытки;
		
		Если СтруктураДокумента.ДокументКорректен = 0 Тогда
			Возврат СтруктураДокумента;
		КонецЕсли;
		
		//DOCUMENT	
		МассивСтрокаДерева = НайтиСтрокиВДереве("DATA/Stock/DOCUMENTS/DOCUMENT", Дерево);
		Если МассивСтрокаДерева.Количество() = 0 Тогда
			ДобавитьОшибкуВСтруктуруДокумента("Ошибка разбора структуры документа""DOCUMENT" ,СтруктураДокумента);
			Возврат СтруктураДокумента;
		КонецЕсли;
		СтрокаДерева = МассивСтрокаДерева[0];
		
		НомерДокумента = НайтиСтрокиВДереве("Number", СтрокаДерева)[0].Значение;
		СтруктураДокумента.Вставить("НомерДокумента",СокрЛП(НомерДокумента));
		
		ДатаДокумента  = НайтиСтрокиВДереве("Date", СтрокаДерева)[0].Значение;
		
		Попытка
			СтруктураДокумента.Вставить("ДатаДокумента",Дата(ДатаДокумента));
		Исключение
			ДобавитьОшибкуВСтруктуруДокумента("Ошибка получения даты из строки: "+ ДатаДокумента ,СтруктураДокумента);
			Возврат СтруктураДокумента;
		КонецПопытки;
		
		
		//Товары
		МассивСтрокДерева =  НайтиСтрокиВДереве("TABLE", СтрокаДерева);
		
		Если МассивСтрокаДерева.Количество() = 0 Тогда
			ДобавитьОшибкуВСтруктуруДокумента("Ошибка разбора структуры документа""TABLE" ,СтруктураДокумента);
			Возврат СтруктураДокумента;
		КонецЕсли;
		
		СтрокаДерева = МассивСтрокДерева[0];
		
		ТаблицаТоваров = Новый ТаблицаЗначений;
		ТаблицаТоваров.Колонки.Добавить("Код");
		ТаблицаТоваров.Колонки.Добавить("Наименование");
		ТаблицаТоваров.Колонки.Добавить("Количество");
		ТаблицаТоваров.Колонки.Добавить("Вес");
		ТаблицаТоваров.Колонки.Добавить("Весовой");
		ТаблицаТоваров.Колонки.Добавить("Коэффициент");
		ТаблицаТоваров.Колонки.Добавить("Цена");
		ТаблицаТоваров.Колонки.Добавить("ШтрихКод");
		ТаблицаТоваров.Колонки.Добавить("МРЦ");
		
		МассивШтрихКодов = Новый Массив;
		
		Для Каждого СтрокаТоваров Из СтрокаДерева.Строки Цикл 
			НоваяСтрока = ТаблицаТоваров.Добавить();
			мнСтрок =  НайтиСтрокиВДереве("Code",СтрокаТоваров);
			Если мнСтрок.Количество() = 0 Тогда
				
			Иначе
				НоваяСтрока.Код = СокрЛП(мнСтрок[0].Значение);
			КонецЕсли;
			
			
			мнСтрок =  НайтиСтрокиВДереве("Name",СтрокаТоваров);
			Если мнСтрок.Количество() = 0 Тогда
				
			Иначе
				НоваяСтрока.Наименование = СокрЛП(мнСтрок[0].Значение);
			КонецЕсли;
			
			мнСтрок =  НайтиСтрокиВДереве("Num",СтрокаТоваров);
			Если мнСтрок.Количество() = 0 Тогда
				
			Иначе
				НоваяСтрока.Количество = Число(мнСтрок[0].Значение);
			КонецЕсли;
			
			
			мнСтрок =  НайтиСтрокиВДереве("Weight",СтрокаТоваров);
			Если мнСтрок.Количество() = 0 Тогда
				
			Иначе
				НоваяСтрока.Вес = Число(мнСтрок[0].Значение);
			КонецЕсли;
			
			мнСтрок =  НайтиСтрокиВДереве("IsWeight",СтрокаТоваров);
			Если мнСтрок.Количество() = 0 Тогда
				
			Иначе
				НоваяСтрока.Весовой = Число(мнСтрок[0].Значение);
			КонецЕсли;
			
			мнСтрок =  НайтиСтрокиВДереве("Unit",СтрокаТоваров);
			Если мнСтрок.Количество() = 0 Тогда
				
			Иначе
				НоваяСтрока.Коэффициент = Число(мнСтрок[0].Значение);
			КонецЕсли;
			
			мнСтрок =  НайтиСтрокиВДереве("Price",СтрокаТоваров);
			Если мнСтрок.Количество() = 0 Тогда
				
			Иначе
				НоваяСтрока.Цена = Число(мнСтрок[0].Значение);
			КонецЕсли;
			
			
			мнСтрок =  НайтиСтрокиВДереве("BarCode",СтрокаТоваров);
			Если мнСтрок.Количество() = 0 Тогда
				
			Иначе
				НоваяСтрока.ШтрихКод = СокрЛП(мнСтрок[0].Значение);
				Если НЕ ПустаяСтрока(НоваяСтрока.ШтрихКод) Тогда
					МассивШтрихКодов.Добавить(НоваяСтрока.ШтрихКод);
				КонецЕсли;
			КонецЕсли;
			
			мнСтрок =  НайтиСтрокиВДереве("MRC",СтрокаТоваров);
			Если мнСтрок.Количество() = 0 Тогда
				
			Иначе
				Если СокрЛП(мнСтрок[0].Значение) <> "" Тогда	//	Тихий
					НоваяСтрока.МРЦ = Число(СокрЛП(мнСтрок[0].Значение));
				КонецЕсли;
			КонецЕсли;
			
			
		КонецЦикла;
		
		СтруктураДокумента.Вставить("Товары",ТаблицаТоваров);
		СтруктураДокумента.Вставить("ШтрихКода", МассивШтрихКодов);
		
		
		Возврат СтруктураДокумента;	
		
	КонецФункции
	
	Процедура ДобавитьОшибкуВСтруктуруДокумента(ТекстОшибки,СтруктураДокумента)
		
		Ошибки = Неопределено;
		СтруктураДокумента.Свойство("ОшибкиДокумента",Ошибки);
		СтруктураДокумента.Вставить("ДокументКорректен",0);
		
		Если Ошибки = Неопределено Тогда
			СтруктураДокумента.Вставить("ОшибкиДокумента",ТекстОшибки);	
		Иначе
			Ошибки = Ошибки + ?(СтрДлина(Ошибки)=0, "", Символы.ПС) + ТекстОшибки;
			СтруктураДокумента.ОшибкиДокумента = Ошибки;
		КонецЕсли;
		
	КонецПроцедуры
	
	Функция НайтиСтрокиВДереве(Знач Путь, СтрокаДерева, Результат = Неопределено)
		
		Если Результат = Неопределено Тогда
			Результат = Новый Массив;
		КонецЕсли;
		
		Если ТипЗнч(Путь) = Тип("Массив") Тогда
			МассивУзлов = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(Путь);
			МассивУзлов.Удалить(0);
		Иначе
			МассивУзлов = СтрокуВМассив(Путь);	
		КонецЕсли;
		
		НайденныеСтроки = СтрокаДерева.Строки.НайтиСтроки(Новый Структура("Имя", МассивУзлов[0]));
		
		Для каждого Элемент Из НайденныеСтроки Цикл
			
			Если МассивУзлов.Количество() = 1 Тогда
				Результат.Добавить(Элемент);
			Иначе
				НайтиСтрокиВДереве(МассивУзлов, Элемент, Результат);
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат Результат;
		
	КонецФункции
	
	Функция ПолучитьОбъектДоставки(Код)
		Попытка
			тКод = Число(Код);
			КодОбъекта = Формат(тКод, "ЧЦ=15; ЧГ=");
		Исключение
			Возврат Новый ТаблицаЗначений;
		КонецПопытки;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладыКомпании.Ссылка КАК СкладКомпании,
		|	ТорговыеПлощадки.Ссылка КАК ТорговаяПлощадка,
		|	СкладыКомпании.ТочкаДоставки КАК ТочкаДоставкиПокупатель,
		|	СкладыКомпании.ТочкаДоставки.Владелец КАК КонтрагентПокупатель
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТорговыеПлощадки КАК ТорговыеПлощадки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|			ПО (ДополнительныеСведения.Объект ССЫЛКА Справочник.ТорговыеПлощадки)
		|				И (ДополнительныеСведения.Свойство.Имя = ""КодТорговойПлощадкиТедис"")
		|				И (ДополнительныеСведения.Значение = &КодТЕДИС)
		|				И ТорговыеПлощадки.Ссылка = ДополнительныеСведения.Объект
		|		ПО СкладыКомпании.ТорговаяПлощадка = ТорговыеПлощадки.Ссылка
		|			И (СкладыКомпании.ТочкаДоставки.Действует)
		|			И (НЕ СкладыКомпании.ЭтоГруппа)
		|			И (НЕ СкладыКомпании.ПометкаУдаления)
		|			И (НЕ СкладыКомпании.ТочкаДоставки = ЗНАЧЕНИЕ(Справочник.ТочкиДоставки.ПустаяСсылка))
		|			И (СкладыКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТорговыйЗал)
		|				ИЛИ СкладыКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТорговыйПавильон))
		|ГДЕ
		|	НЕ ТорговыеПлощадки.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("КодТЕДИС", КодОбъекта);
		
		тз = Запрос.Выполнить().Выгрузить();
		
		Возврат тз;
	КонецФункции
	
	Функция СтрокуВМассив(пСтрока, Разделитель = "/")
		
		СтрокаТекста = СтрЗаменить(пСтрока, Разделитель, Символы.ПС);
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(СтрокаТекста);
		лМассив = Новый Массив;
		
		Для НомерСтроки = 1 По ТекстовыйДокумент.КоличествоСтрок() Цикл 
			лМассив.Добавить(ТекстовыйДокумент.ПолучитьСтроку(НомерСтроки));
		КонецЦикла;	
		
		Возврат лМассив;
		
	КонецФункции	
	
	Процедура ЗаполнитьДеревоДокументов(СтруктураДокумента, ДеревоДокументов, КешЗагружаемыхДанных)
		
		СтрокаДерева = ДеревоДокументов.Строки.Добавить();
		СтрокаДерева.ДокументНоменклатура = "Документ № "+ СтруктураДокумента.НомерДокумента + " от "+ Формат(СтруктураДокумента.ДатаДокумента,"ДФ=dd.MM.yyyy");
		СтрокаДерева.ДатаДокумента = СтруктураДокумента.ДатаДокумента;
		СтрокаДерева.НомерДокумента = СтруктураДокумента.НомерДокумента;
		СтрокаДерева.ИмяФайла       = СтруктураДокумента.ИмяФайла;
		СтрокаДерева.Выбор = Истина;
		СтрокаДерева.ДокументАгента = СтруктураДокумента.ДокументАгента;
		
		Если СтруктураДокумента.ДокументАгента = 1 Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 	"ВЫБРАТЬ
			|	ЗаказПокупателя.Ссылка КАК ДокументОснование,
			|	ЗаказПокупателя.Контрагент КАК Контрагент,
			|	ЗаказПокупателя.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
			|	ЗаказПокупателя.ТочкаДоставки КАК ТочкаДоставки,
			|	ЗаказПокупателя.ТочкаДоставки.ПорядокСигаретный КАК ПорядокСигаретный
			|ИЗ
			|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
			|ГДЕ
			|	ЗаказПокупателя.Номер = &Номер
			|	И ЗаказПокупателя.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
			
			Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(СтруктураДокумента.ДатаЗаказа));
			Запрос.УстановитьПараметр("КонецПериода",КонецДня(СтруктураДокумента.ДатаЗаказа));
			Запрос.УстановитьПараметр("Номер", СтруктураДокумента.НомерЗаказа);
			
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			КонтрагентПокупатель 	= Справочники.Контрагенты.ПустаяСсылка();
			ТочкаДоставкиПокупатель = Справочники.ТочкиДоставки.ПустаяСсылка();
			ДоговорПокупателя      	= Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
			ЗаказПокупателя         = Документы.ЗаказПокупателя.ПустаяСсылка();
			Порядок = "";
			
			Если Выборка.Следующий() Тогда
				КонтрагентПокупатель	= Выборка.Контрагент;
				ТочкаДоставкиПокупатель = Выборка.ТочкаДоставки;
				ДоговорПокупателя       = Выборка.ДоговорВзаиморасчетов;
				Порядок					= Лев(Выборка.ПорядокСигаретный,1);
				ЗаказПокупателя 	    = Выборка.ДокументОснование;
				
			КонецЕсли;
			
			СтрокаДерева.ЗаказПокупателя   = ЗаказПокупателя;
			СтрокаДерева.ДоговорПокупателя = ДоговорПокупателя;	
			
		ИначеЕсли СтруктураДокумента.ДокументАгента = 2 Тогда
			
			КонтрагентПокупатель = СтруктураДокумента.КонтрагентПокупатель;
			ТочкаДоставкиПокупатель = СтруктураДокумента.ТочкаДоставкиПокупатель;
			Порядок = Лев(ТочкаДоставкиПокупатель.ПорядокСигаретный,1);
			
			СтрокаДерева.СкладКомпании  =  СтруктураДокумента.СкладКомпании;
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Контрагенты.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.КодПоЕДРПОУ = &КодПоОКПО";
			
			Запрос.УстановитьПараметр("КодПоОКПО", СтруктураДокумента.ОКПО_Покупатель);
			
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			КонтрагентПокупатель = Справочники.Контрагенты.ПустаяСсылка();
			Если Выборка.Следующий() Тогда
				КонтрагентПокупатель = Выборка.Ссылка;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТочкиДоставки.Ссылка КАК Ссылка,
			|	ТочкиДоставки.ПорядокСигаретный КАК ПорядокСигаретный
			|ИЗ
			|	Справочник.ТочкиДоставки КАК ТочкиДоставки
			|ГДЕ
			|	ТочкиДоставки.Владелец = &Владелец
			|	И ТочкиДоставки.Код = &Код";
			
			Запрос.УстановитьПараметр("Владелец", КонтрагентПокупатель);
			Запрос.УстановитьПараметр("Код", СтруктураДокумента.КодТочкиДоставкиПокупатель);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			ТочкаДоставкиПокупатель = Справочники.ТочкиДоставки.ПустаяСсылка();
			Порядок = "";
			Если  ВыборкаДетальныеЗаписи.Следующий() Тогда
				ТочкаДоставкиПокупатель  = ВыборкаДетальныеЗаписи.ссылка;
				Порядок = Лев(ВыборкаДетальныеЗаписи.ПорядокСигаретный,1);
			КонецЕсли;
		КонецЕсли;
		
		СтрокаДерева.ТочкаДоставки = ТочкаДоставкиПокупатель;
		СтрокаДерева.Маршрут = Порядок;	
		СтрокаДерева.Контрагент = КонтрагентПокупатель;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
		|ГДЕ
		|	ПоступлениеТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ ПоступлениеТоваров.ПометкаУдаления
		|	И ПоступлениеТоваров.ВхДокНомер = &ВхДокНомер
		|	И ПоступлениеТоваров.ВхДокДата = &ВхДокДата";
		
		Запрос.УстановитьПараметр("ВхДокДата", СтруктураДокумента.ДатаДокумента);
		Запрос.УстановитьПараметр("ВхДокНомер", СтруктураДокумента.НомерДокумента);
		Запрос.УстановитьПараметр("КонецПериода", ДобавитьМесяц(СтруктураДокумента.ДатаДокумента,1));
		Запрос.УстановитьПараметр("НачалоПериода", ДобавитьМесяц(СтруктураДокумента.ДатаДокумента,-1));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ДокументПоступления = Документы.ПоступлениеТоваров.ПустаяСсылка();
		
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ДокументПоступления = ВыборкаДетальныеЗаписи.Ссылка;
			СтрокаДерева.Выбор = Ложь;
		КонецЕсли;
		
		СтрокаДерева.ДокументЗагрузки = ДокументПоступления;
		
		Если СтруктураДокумента.ДокументАгента = 1 Тогда
			
			Если НЕ СтрокаДерева.ЗаказПокупателя.Пустая() Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	РеализацияТоваров.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.РеализацияТоваров КАК РеализацияТоваров
				|ГДЕ
				|	РеализацияТоваров.ПометкаУдаления = ЛОЖЬ
				|	И РеализацияТоваров.ДокументОснование = &ДокументОснование";
				
				Запрос.УстановитьПараметр("ДокументОснование", СтрокаДерева.ЗаказПокупателя);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Следующий() Тогда
					СтрокаДерева.ДокументОснование = ВыборкаДетальныеЗаписи.Ссылка;
					
				Иначе
					СтрокаДерева.ДокументОснование = Документы.РеализацияТоваров.ПустаяСсылка();
				КонецЕсли;
				
			Иначе
				СтрокаДерева.ДокументОснование = Документы.РеализацияТоваров.ПустаяСсылка();
			КонецЕсли;
			
			
		Иначе
			
			Если НЕ ДокументПоступления.Пустая() Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	РеализацияТоваров.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.РеализацияТоваров КАК РеализацияТоваров
				|ГДЕ
				|	РеализацияТоваров.ПометкаУдаления = ЛОЖЬ
				|	И РеализацияТоваров.ДокументОснование = &ДокументОснование";
				
				Запрос.УстановитьПараметр("ДокументОснование", ДокументПоступления);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Следующий() Тогда
					СтрокаДерева.ДокументОснование = ВыборкаДетальныеЗаписи.Ссылка;
					
				Иначе
					СтрокаДерева.ДокументОснование = Документы.РеализацияТоваров.ПустаяСсылка();
				КонецЕсли;
				
			Иначе
				СтрокаДерева.ДокументОснование = Документы.РеализацияТоваров.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
		
		ТаблицаТоваров = ПолучитьтаблицуТоваровПоШтрихКоду(СтруктураДокумента);
		ВсегоПоДокументу = 0;
		ВсегоКоличествоПоДокументу = 0;
		Для Каждого СтрокаТовары Из СтруктураДокумента.Товары Цикл 
			СтрокаДереваТовары = СтрокаДерева.Строки.Добавить();
			
			нНоменклатура = ТаблицаТоваров.Найти(СтрокаТовары.ШтрихКод);
			Если нНоменклатура<>Неопределено Тогда
				СтрокаДереваТовары.ДокументНоменклатура = нНоменклатура.Номенклатура;   
			Иначе
				СтрокаДереваТовары.ДокументНоменклатура  = ПолучитьТоварПоКодуПоставщика(СтрокаТовары.Код);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаДереваТовары.ДокументНоменклатура) Тогда
				ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не найдет товар! в накладной ""%1""
				|Штирх - код : %2, код Тедис: %3'; uk = 'Товар не знайдений! В накладній ""%1""
				|Штрих-код: %2, код Тедіс: %3'"),
				СтрокаДерева.ДокументНоменклатура,
				СтрокаТовары.ШтрихКод,
				СтрокаТовары.Код));
			КонецЕсли;			   
			
			Если НЕ ПустаяСтрока(СтрокаТовары.МРЦ) Тогда
				СтруктураОтбора = Новый Структура("Номенклатура,МРЦ",СтрокаДереваТовары.ДокументНоменклатура,СтрокаТовары.МРЦ); 
				нХарактеристика = КешЗагружаемыхДанных.КешХарактеристика.НайтиСтроки(СтруктураОтбора);
				
				Если ТипЗнч(СтруктураДокумента.СкладКомпании) = Тип("СправочникСсылка.СкладыКомпании") Тогда 
					ТипЦен = Справочники.СкладыКомпании.ТипЦенСебестоимости(СтруктураДокумента.СкладКомпании);
				Иначе
					ТипЦен = Справочники.ТипыЦен.ПустаяСсылка();
				КонецЕсли;
				
				Если нХарактеристика.Количество() = 0 Тогда
					НоваяХарактеристика = Ложь;
					
					Если КешЗагружаемыхДанных.СоздатьМРЦ Тогда 				
						ПараметрыСозданияМРЦ = Новый Структура("Номенклатура,МРЦ");
						ЗаполнитьЗначенияСвойств(ПараметрыСозданияМРЦ, СтруктураОтбора);
						
						Результат = НайтиСоздатьМРЦ(ПараметрыСозданияМРЦ);
						
						Если Результат.Успешно Тогда 					
							НоваяХарактеристика = Истина;
							
							СтрокаДереваТовары.ХарактеристикаНоменклатуры = Результат.Характеристика;
							
							СтрНовМРЦ = КешЗагружаемыхДанных.ТаблицаНовыхМРЦ.Добавить();
							СтрНовМРЦ.Номенклатура = нНоменклатура;
							СтрНовМРЦ.Характеристика = Результат.Характеристика;
							СтрНовМРЦ.Цена = СтрокаТовары.Цена;
							СтрНовМРЦ.ТипЦен = ТипЦен;
							
							Если ЦенообразованиеСервер.СоздаватьИзменениеЦен(СтруктураОтбора.Номенклатура) Тогда
								ЦенообразованиеСервер.ПереоЦенкаМРЦ(СтруктураОтбора.Номенклатура, СтруктураОтбора.МРЦ, Результат.ГУИД_МРЦ);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
					СтрокаКеша = КешЗагружаемыхДанных.КешХарактеристика.Добавить();
					СтрокаКеша.Номенклатура = СтрокаДереваТовары.ДокументНоменклатура;
					СтрокаКеша.МРЦ          = СтрокаТовары.МРЦ;
					СтрокаКеша.Характеристика = СтрокаДереваТовары.ХарактеристикаНоменклатуры;
					СтрокаКеша.НоваяХарактеристика = НоваяХарактеристика;
				Иначе
					нСтрокаХарактеристики = нХарактеристика[0];
					СтрокаДереваТовары.ХарактеристикаНоменклатуры = нСтрокаХарактеристики.Характеристика;
					
					Если нСтрокаХарактеристики.НоваяХарактеристика И ЗначениеЗаполнено(ТипЦен) Тогда
						мНовыеМРЦ = КешЗагружаемыхДанных.ТаблицаНовыхМРЦ.НайтиСтроки(Новый Структура("ТипЦен,Характеристика", ТипЦен, нСтрокаХарактеристики.Характеристика));
						Если мНовыеМРЦ.Количество() = 0 Тогда 
							СтрНовМРЦ = КешЗагружаемыхДанных.ТаблицаНовыхМРЦ.Добавить();
							СтрНовМРЦ.Номенклатура = нНоменклатура;
							СтрНовМРЦ.Характеристика = Результат.Характеристика;	
							СтрНовМРЦ.Цена = СтрокаТовары.Цена;
							СтрНовМРЦ.ТипЦен = ТипЦен;						
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				СтрокаДереваТовары.ХарактеристикаНоменклатуры = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
			КонецЕсли;
			
			СтрокаДереваТовары.Количество = СтрокаТовары.Количество;
			СтрокаДереваТовары.Цена       = СтрокаТовары.Цена;
			СтрокаДереваТовары.СуммаВсего = СтрокаТовары.Цена * СтрокаТовары.Количество;
			ВсегоПоДокументу = ВсегоПоДокументу + СтрокаДереваТовары.СуммаВсего;
			ВсегоКоличествоПоДокументу = ВсегоКоличествоПоДокументу +  СтрокаДереваТовары.Количество;
		КонецЦикла;
		
		СтрокаДерева.СуммаВсего = ВсегоПоДокументу;
		СтрокаДерева.Количество = ВсегоКоличествоПоДокументу;
		
		
	КонецПроцедуры
	
	Функция ПолучитьТоварПоКодуПоставщика(Код)
		
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	ДополнительныеСведения.Объект КАК Номенклатура
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура
		|	И ДополнительныеСведения.Свойство.Имя = ""КодТедис""
		|	И ДополнительныеСведения.Значение = &КодТедис");
		
		Запрос.УстановитьПараметр("КодТедис",Код);
		РезультатПоиска=Запрос.Выполнить();
		
		Если РезультатПоиска.Пустой() Тогда
			Возврат Справочники.Номенклатура.ПустаяСсылка();
		Иначе
			Выборка = РезультатПоиска.Выбрать();
			Выборка.Следующий();
			Возврат Выборка.Номенклатура;
			
		КонецЕсли;
		
	КонецФункции
	
	Функция СтруктураДокументаВерна(СтруктураДокумента, ТекФайл )
		
		Если СтруктураДокумента.ДокументКорректен = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Файл <%1> не загружен!
			|Причина: %2'; uk = 'Файл <%1> не завантажений!
			|Причина: %2'"),
			ТекФайл.Имя,
			СтруктураДокумента.ОшибкиДокумента));
			Возврат Ложь;
		КонецЕсли;
		
		Возврат Истина;
	КонецФункции
	
	Функция ПолучитьтаблицуТоваровПоШтрихКоду(СтруктураДокумента)
		
		ТаблицаТоваров = Новый ТаблицаЗначений;
		ТаблицаТоваров.Колонки.Добавить("Номенклатура");
		ТаблицаТоваров.Колонки.Добавить("ШтрихКод");
		
		Если СтруктураДокумента.ШтрихКода.Количество() = 0 Тогда
			Возврат ТаблицаТоваров;
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
			|	ШтрихкодыНоменклатуры.Штрихкод КАК ШтрихКод
			|ИЗ
			|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
			|ГДЕ
			|	ШтрихкодыНоменклатуры.Штрихкод В(&ШтрихКод)";
			
			Запрос.УстановитьПараметр("ШтрихКод",  СтруктураДокумента.ШтрихКода);
			
			РезультатЗапроса = Запрос.Выполнить();
			ТаблицаТоваров = РезультатЗапроса.Выгрузить();
			ТаблицаТоваров.Индексы.Добавить("ШтрихКод");
			Возврат ТаблицаТоваров;
		КонецЕсли;
		
		
	КонецФункции
	
	Функция НайтиСоздатьМРЦ(Параметры)
		
		Номенклатура = Параметры.Номенклатура;
		МРЦ = Параметры.МРЦ;		
		
		ПараметрыСозданияМРЦ = Новый Структура;
		ПараметрыСозданияМРЦ.Вставить("ВыводитьСообщение", Истина);
		ПараметрыСозданияМРЦ.Вставить("ОтправлятьНаПочту", Истина);
		ПараметрыСозданияМРЦ.Вставить("КлючОбработки", "Загрузка приходов ""Тедис""");
		
		Результат = ТК_ОбменCentr.ОтправитьЗапросНаСозданиеМРЦ(Номенклатура, МРЦ, ПараметрыСозданияМРЦ);
		
		Возврат Результат;
	КонецФункции
	
	Процедура СформироватьПереоценкиНовыхМРЦ(ТаблицаМРЦ)
		
		УстановитьПривилегированныйРежим(Истина);
		
		ТипыЦен = ТаблицаМРЦ.Скопировать(,"ТипЦен");
		ТипыЦен.Свернуть("ТипЦен");
		
		СписокТиповЦен = Новый ТаблицаЗначений;
		СписокТиповЦен.Колонки.Добавить("ТипЦен", Новый ОписаниеТипов("СправочникСсылка.ТипыЦен"));
		СписокТиповЦен.Колонки.Добавить("Базовый", Новый ОписаниеТипов("Булево"));
		СписокТиповЦен.Колонки.Добавить("Порядок", ОбщегоНазначения.ОписаниеТипаЧисло(3,0, ДопустимыйЗнак.Неотрицательный));
		
		СписокТиповЦен.ЗагрузитьКолонку(ТипыЦен.ВыгрузитьКолонку("ТипЦен"), "ТипЦен");
		СписокТиповЦен.ЗаполнитьЗначения(Истина, "Базовый");
		СписокТиповЦен.ЗаполнитьЗначения(100, "Порядок");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СписокТиповЦен", СписокТиповЦен);
		
		Запрос.Текст = "ВЫБРАТЬ
		|	СписокТиповЦен.ТипЦен КАК ТипЦен,
		|	СписокТиповЦен.Базовый КАК Базовый,
		|	СписокТиповЦен.Порядок КАК Порядок
		|ПОМЕСТИТЬ втСписокБазовыхТиповЦен
		|ИЗ
		|	&СписокТиповЦен КАК СписокТиповЦен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСписокБазовыхТиповЦен.ТипЦен КАК ТипЦен,
		|	ВЫРАЗИТЬ(втСписокБазовыхТиповЦен.ТипЦен КАК Справочник.ТипыЦен).ВалютаЦены КАК ВалютаЦены,
		|	ВЫРАЗИТЬ(втСписокБазовыхТиповЦен.ТипЦен КАК Справочник.ТипыЦен).БазовыйТипЦен КАК БазовыйТипЦен,
		|	ВЫРАЗИТЬ(втСписокБазовыхТиповЦен.ТипЦен КАК Справочник.ТипыЦен).ВариантОкругления КАК ВариантОкругления,
		|	ВЫРАЗИТЬ(втСписокБазовыхТиповЦен.ТипЦен КАК Справочник.ТипыЦен).Точность КАК Точность,
		|	втСписокБазовыхТиповЦен.Базовый КАК Базовый,
		|	втСписокБазовыхТиповЦен.Порядок КАК Порядок
		|ПОМЕСТИТЬ СписокТиповЦен
		|ИЗ
		|	втСписокБазовыхТиповЦен КАК втСписокБазовыхТиповЦен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТипыЦен.Ссылка,
		|	ТипыЦен.ВалютаЦены,
		|	втСписокБазовыхТиповЦен.ТипЦен,
		|	ТипыЦен.ВариантОкругления,
		|	ТипыЦен.Точность,
		|	ЛОЖЬ,
		|	150
		|ИЗ
		|	втСписокБазовыхТиповЦен КАК втСписокБазовыхТиповЦен
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТипыЦен КАК ТипыЦен
		|		ПО втСписокБазовыхТиповЦен.ТипЦен = ТипыЦен.БазовыйТипЦен
		|			И (НЕ ТипыЦен.ПометкаУдаления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокТиповЦен.ТипЦен КАК ТипЦен,
		|	СписокТиповЦен.ВалютаЦены КАК ВалютаДокумента,
		|	СписокТиповЦен.БазовыйТипЦен КАК БазовыйТипЦен,
		|	СписокТиповЦен.ВариантОкругления КАК ВариантОкругления,
		|	СписокТиповЦен.Точность КАК Точность,
		|	СписокТиповЦен.Базовый КАК Базовый,
		|	СписокТиповЦен.Порядок КАК Порядок
		|ИЗ
		|	СписокТиповЦен КАК СписокТиповЦен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
		
		ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("000000002"); //ТС Аттика - переоценки создаются исключительно на подразделение ТС Аттика
		
		РеквизитыИЦ = Новый Структура;
		РеквизитыИЦ.Вставить("Автор", 					Пользователи.ТекущийПользователь());
		РеквизитыИЦ.Вставить("ДатаДокумента",			ТекущаяДата()); 
		РеквизитыИЦ.Вставить("ХозОперация", 			ПредопределенноеЗначение("Справочник.ХозОперации.ИзменениеЦен"));
		РеквизитыИЦ.Вставить("ПодразделениеКомпании", 	ПодразделениеКомпании); //ЗначениеНастроекПовтИсп.ПодразделениеПользователя(РеквизитыИЦ.Автор, ПредопределенноеЗначение("Справочник.ПодразделенияКомпании.ПустаяСсылка")));
		РеквизитыИЦ.Вставить("Организация", 			Справочники.Организации.НайтиПоРеквизиту("КодПоЕДРПОУ", "36224758")); //ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(РеквизитыИЦ.Автор,"ОсновнаяОрганизация", ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка")));
		РеквизитыИЦ.Вставить("КурсДокумента",			1);
		РеквизитыИЦ.Вставить("Комментарий",				НСтр("ru = 'Создано автоматически при загрузке приходов ТЕДИС'"));
		
		//Если Не ЗначениеЗаполнено(РеквизитыИЦ.ПодразделениеКомпании) Тогда 
		//	РеквизитыИЦ.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("000000008"); //ТС Buffet
		//КонецЕсли;
		
		//Если Не ЗначениеЗаполнено(РеквизитыИЦ.Организация) Тогда 
		//	РеквизитыИЦ.Организация = Справочники.Организации.НайтиПоРеквизиту("КодПоЕДРПОУ", "36224758"); //Основа Инфо ООО
		//КонецЕсли;
		
		ВыборкаТипыЦен = Запрос.Выполнить().Выбрать();
		Пока ВыборкаТипыЦен.Следующий() Цикл 
			мТовары = ТаблицаМРЦ.НайтиСтроки(Новый Структура("ТипЦен", ВыборкаТипыЦен.ТипЦен));
			
			ПараметрыСозданияИЦ = Новый Структура("ТипЦен,ВалютаДокумента,БазовыйТипЦен, ВариантОкругления, Точность, Базовый");
			ЗаполнитьЗначенияСвойств(ПараметрыСозданияИЦ, ВыборкаТипыЦен);
			
			ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыСозданияИЦ, РеквизитыИЦ, Истина);
			
			СформироватьИзменениеЦен(мТовары, ПараметрыСозданияИЦ);
		КонецЦикла;
		
	КонецПроцедуры
	
	Процедура СформироватьИзменениеЦен(ТаблицаТовары, СвойстваТипаЦен)
		
		УстановитьПривилегированныйРежим(Истина);
		
		БазовыйТипЦен = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СвойстваТипаЦен, "Базовый", Ложь);
		ТЦ_МРЦ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СвойстваТипаЦен, "МРЦ", Ложь);	
		Точность = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СвойстваТипаЦен, "Точность", 2);		
		Дата = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СвойстваТипаЦен, "ДатаДокумента", ТекущаяДата());		
		ТипЦен = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СвойстваТипаЦен, "ТипЦен", ПредопределенноеЗначение("Справочник.ТипыЦен.ПустаяСсылка"));
		
		ДокИЦ = Документы.ИзменениеЦен.СоздатьДокумент();
		ДокИЦ.Заполнить(СвойстваТипаЦен);
		
		ДатаНачала = ?(БазовыйТипЦен, Дата, Дата + 5);
		
		ДокИЦ.Дата = ДатаНачала;
		ДокИЦ.ДатаНачалаДействия = ДатаНачала + (60*10);
		ДокИЦ.ОкруглятьДо = ?(БазовыйТипЦен, 0.000001, 1/Pow(10, Точность));
		
		ЗаполнитьЗначенияСвойств(ДокИЦ, СвойстваТипаЦен, "ВалютаДокумента, ТипЦен, БазовыйТипЦен, ПодразделениеКомпании, Организация, Комментарий");
		
		КэшированныеЗначения = Неопределено;
		СтруктураДействий = Новый Структура;
		
		Если Не БазовыйТипЦен Тогда 
			КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
			
			ПараметрыПолученияЦены = Новый Структура;
			ПараметрыПолученияЦены.Вставить("Дата", ДатаНачала);
			ПараметрыПолученияЦены.Вставить("ТипЦен", ДокИЦ.БазовыйТипЦен);
			ПараметрыПолученияЦены.Вставить("ГраницаИсклюая", Истина);
			
			СтруктураПолейДляЗаполненияЦен = Новый Структура;			
			СтруктураПолейДляЗаполненияЦен.Вставить("ЦенаБазовая", ПараметрыПолученияЦены);	
			
			
			
			СтруктураДействий.Вставить("ЗаполнитьЦены", СтруктураПолейДляЗаполненияЦен);					
			СтруктураДействий.Вставить("ЗаполнитьРекомендованныеНаценки", Новый Структура("ТипЦен", ТипЦен));
			СтруктураДействий.Вставить("ЗаполнитьПроцентНаценкиИзРекомендованных");
			СтруктураДействий.Вставить("ПересчитатьНовуюЦенуПоПроцентуНаценки");	
			
			ПараметрыОкргуления = ПолучитьПараметрыОкргуленияТипаЦен(ДокИЦ.ТипЦен);
			СтруктураДействий.Вставить("ПересчитатьНовуюЦенуСУчетомОкругления", ПараметрыОкргуления);		
		КонецЕсли;
		
		Для Каждого Стр Из ТаблицаТовары Цикл 
			НоваяСтрока = ДокИЦ.Товары.Добавить();	
			НоваяСтрока.Номенклатура = Стр.Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры = Стр.Характеристика;
			
			Если БазовыйТипЦен Тогда 			
				НоваяСтрока.НоваяЦена = Стр.Цена;									
			Иначе			
				НоваяСтрока.ЦенаБазовая = Стр.Цена;			
				ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, КэшированныеЗначения);
			КонецЕсли;						
		КонецЦикла;
		
		Если ДокИЦ.ПроверитьЗаполнение() Тогда 
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
		Иначе
			РежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли;
		
		Отказ = Ложь;
		
		Попытка
			ДокИЦ.Записать(РежимЗаписи);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			
			Попытка
				ДокИЦ.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Не удалось записать документ '; uk = 'Не вдалося записати документ '") + ДокИЦ,,,, Отказ);
			КонецПопытки;
		КонецПопытки;
		
		
		Если Не Отказ Тогда 
			
			ОбщегоНазначения.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 документ %2'; uk = '%1 документ %2'"),
			?(ДокИЦ.Проведен, НСтр("ru = 'Проведен'; uk = 'Проведений'"), НСтр("ru = 'Записан'; uk = 'Записаний'")),
			ДокИЦ),
			ДокИЦ.Ссылка);
			
		КонецЕсли;
		
	КонецПроцедуры
	
	Функция ПолучитьПараметрыОкргуленияТипаЦен(Знач ТипЦен)	
		
		Результат = Новый Структура("ВариантОкругления, Точность,ПравилоРасчета", Неопределено, 0,0);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ТипыЦен.ВариантОкругления КАК ВариантОкругления,
		|	ТипыЦен.Точность КАК Точность,
		|	ТипыЦен.ПравилоРасчета КАК ПравилоРасчета
		|ИЗ
		|	Справочник.ТипыЦен КАК ТипыЦен
		|ГДЕ
		|	ТипыЦен.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ТипЦен);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			ЗаполнитьЗначенияСвойств(Результат, Выборка);
		КонецЕсли;
		
		Возврат Результат;
	КонецФункции
	
	#КонецОбласти
	
	
	
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
